In [1]:
# library (readr)
import pandas as pd

urlfile="https://raw.githubusercontent.com/codebasics/py/master/ML/9_decision_tree/Exercise/titanic.csv"
df=pd.read_csv(urlfile)
targets=df['Survived']
targets=pd.DataFrame(targets)
type(targets)
# mydata<-read_csv(url(urlfile))

pandas.core.frame.DataFrame

In [2]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
# inputs=pd.DataFrame()

In [4]:
inputs=df.drop(['PassengerId', 'Name', 'SibSp',	'Parch', 'Ticket', 'Embarked','Cabin','Survived'], axis=1)
type(inputs)

pandas.core.frame.DataFrame

In [5]:
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [6]:
type(inputs)

pandas.core.frame.DataFrame

In [7]:
inputs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  891 non-null    int64
 1   Sex     891 non-null    object
 2   Age     714 non-null    float64
 3   Fare    891 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 28.0+ KB

In [8]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  891 non-null    int64
 1   Sex     891 non-null    object
 2   Age     891 non-null    float64
 3   Fare    891 non-null    float64
dtypes: float64(2), int64(1), object(1)
memory usage: 28.0+ KB

In [9]:
dummies=pd.get_dummies(inputs['Sex'])
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [10]:
inputs=pd.concat([inputs, dummies], axis=1)
inputs.head()
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [11]:
# pd.DataFrame(targets)
targets.head()

   Survived
0         0
1         1
2         1
3         1
4         0

In [12]:
from sklearn.model_selection import train_test_split
x_train,  x_test, y_train,y_test=train_test_split(inputs, targets, test_size=0.2)

In [13]:
inputs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  891 non-null    int64
 1   Age     891 non-null    float64
 2   Fare    891 non-null    float64
 3   female  891 non-null    uint8
dtypes: float64(2), int64(1), uint8(1)
memory usage: 21.9 KB

In [14]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()
inputs=inputs.astype(int)
model.fit(x_train, y_train)
model.score(x_test, y_test)

C:\Users\inaze\AppData\Local\Programs\Python\Python310\lib\site-packages\sklearn\utils\validation.py:993: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

0.7877094972067039

In [15]:
y_test[:10]

     Survived
483         1
34          0
728         0
530         1
313         0
421         0
549         1
657         0
515         0
79          1

In [16]:
y_predicted=model.predict(x_test[:10])
y_predicted

array([1, 1, 0, 1, 0, 0, 0, 1, 0, 1], dtype=int64)

In [17]:
model.predict_proba(x_test[:10])

array([[0.39202008, 0.60797992],
       [0.35818306, 0.64181694],
       [0.92079942, 0.07920058],
       [0.1450599 , 0.8549401 ],
       [0.9650789 , 0.0349211 ],
       [0.96098406, 0.03901594],
       [0.86988271, 0.13011729],
       [0.44891226, 0.55108774],
       [0.7709945 , 0.2290055 ],
       [0.44257781, 0.55742219]])